const markersData = [
    {
        xRatio: 0.1596,
        yRatio: 0.48829,
        size: 16,
        info: "출입구 // 백기관",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.21164,
        yRatio: 0.45002,
        size: 16,
        info: "출입구 // 조형관",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.27432,
        yRatio: 0.35165,
        size: 16,
        info: "출입구 // 미래관 정문",
        password: "X",
        description: "보안장치 있으나 활용X",
        stime: 0, //열리는 시간
        etime: 24, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.25505,
        yRatio: 0.30714,
        size: 16,
        info: "출입구 // 미래관 쪽문",
        password: "X",
        description: "보안장치 있으나 활용X",
        stime: 0, //열리는 시간
        etime: 24, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.21232,
        yRatio: 0.53273,
        size: 16,
        info: "출입구 // 전농관 정문",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.22551,
        yRatio: 0.55544,
        size: 16,
        info: "출입구 // 전농관 후문",
        password: "X",
        description: "비인가 시간 동안 사용 불가",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.2504,
        yRatio: 0.55265,
        size: 16,
        info: "출입구 // 전농관 쪽문",
        password: "X",
        description: "비인가 시간 동안 사용 불가",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.35785,
        yRatio: 0.43355,
        size: 16,
        info: "출입구 // 건설공학관 정문",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.34733,
        yRatio: 0.47776,
        size: 16,
        info: "출입구 // 건설공학관 쪽문",
        password: "X",
        description: "보안장치 X",
        stime: 0, //열리는 시간
        etime: 24, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.36224,
        yRatio: 0.51264,
        size: 16,
        info: "출입구 // 건설공학관 주차장",
        password: "X",
        description: "비인가 시간 동안 사용 불가",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.32072,
        yRatio: 0.83825,
        size: 16,
        info: "출입구 // 법학관 정문",
        password: "X",
        description: "비인가 시간 동안 사용 불가",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.39182,
        yRatio: 0.60587,
        size: 16,
        info: "출입구 // 21세기관 북쪽",
        password: "X",
        description: "비인가 시간 동안 사용 불가",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.38879,
        yRatio: 0.65231,
        size: 16,
        info: "출입구 // 21세기관 남쪽",
        password: "X",
        description: "비인가 시간 동안 사용 불가",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.41955,
        yRatio: 0.61157,
        size: 16,
        info: "출입구 // 21세기관 지하",
        password: "X",
        description: "보안장치 있으나 활용X",
        stime: 0, //열리는 시간
        etime: 24, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.4663,
        yRatio: 0.74537,
        size: 16,
        info: "출입구 // 자연과학관 북쪽",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.50585,
        yRatio: 0.74915,
        size: 16,
        info: "출입구 // 자연과학관 남쪽",
        password: "X",
        description: "비인가 시간 동안 사용 불가",
        stime: 7, //열리는 시간
        etime: 22, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.4606,
        yRatio: 0.79769,
        size: 16,
        info: "출입구 // 자연과학관 동쪽",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.41084,
        yRatio: 0.30278,
        size: 16,
        info: "출입구 // 시대융합관",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.52007,
        yRatio: 0.33473,
        size: 16,
        info: "출입구 // 배봉관",
        password: "X",
        description: "보안장치 있으나 활용X",
        stime: 0, //열리는 시간
        etime: 24, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.57391,
        yRatio: 0.34795,
        size: 16,
        info: "출입구 // 창공관 서쪽",
        password: "X",
        description: "보안장치 있으나 활용X",
        stime: 0, //열리는 시간
        etime: 24, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.60974,
        yRatio: 0.35765,
        size: 16,
        info: "출입구 // 창공관 동쪽",
        password: "X",
        description: "보안장치 있으나 활용X",
        stime: 0, //열리는 시간
        etime: 24, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.52482,
        yRatio: 0.49717,
        size: 16,
        info: "출입구 // 학생회관 서쪽",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.57598,
        yRatio: 0.49659,
        size: 16,
        info: "출입구 // 학생회관 동쪽",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.62854,
        yRatio: 0.47973,
        size: 16,
        info: "출입구 // 인문학관 서쪽",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.65109,
        yRatio: 0.47973,
        size: 16,
        info: "출입구 // 인문학관 동쪽",
        password: "X",
        description: "보안장치 있으나 활용X",
        stime: 0, //열리는 시간
        etime: 24, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.63205,
        yRatio: 0.63110,
        size: 16,
        info: "출입구 // 정보기술관 쪽문",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 9, //열리는 시간
        etime: 21, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.58406,
        yRatio: 0.71042,
        size: 16,
        info: "출입구 // 정보기술관 지하",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.62914,
        yRatio: 0.67349,
        size: 16,
        info: "출입구 // 정보기술관 정문",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.71109,
        yRatio: 0.29951,
        size: 16,
        info: "출입구 // 중앙도서관",
        password: "X",
        description: "학생증 필요",
        stime: 0, //열리는 시간
        etime: 24, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.77805,
        yRatio: 0.56959,
        size: 16,
        info: "출입구 // 음악관",
        password: "X",
        description: "비인가 시간 동안 학생증 필요",
        stime: 6, //열리는 시간
        etime: 23, //닫히는 시간
        flag: 2 //출입문
    },
    {
        xRatio: 0.15015,
        yRatio: 0.33756,
        size: 16,
        info: "화장실 // 백기관 내부",
        password: "X",
        gender: "남녀 공용",
        description: "비데 : 1 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.13451,
        yRatio: 0.37978,
        size: 16,
        info: "화장실 // 백기관 엘리베이터",
        password: "X",
        gender: "남성 전용",
        description: "비데 : 1 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.14561,
        yRatio: 0.48363,
        size: 16,
        info: "화장실 // 백기관 정문",
        password: "X",
        gender: "여성",
        description: "정보 부족",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.57393,
        yRatio: 0.32102,
        size: 16,
        info: "화장실 // 창공관 서쪽",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 하",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.61348,
        yRatio: 0.31543,
        size: 16,
        info: "화장실 // 창공관 동쪽",
        password: "X",
        gender: "공용",
        description: "비데 : 0 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    }, 
    {
        xRatio: 0.74486,
        yRatio: 0.27949,
        size: 16,
        info: "화장실 // 중앙도서관",
        password: "X",
        gender: "공용",
        description: "비데 : 2 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    }, 
    {
        xRatio: 0.78004,
        yRatio: 0.61343,
        size: 16,
        info: "화장실 // 음악관",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 상",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.27097,
        yRatio: 0.87763,
        size: 16,
        info: "화장실 // 법학관",
        password: "X",
        gender: "공용",
        description: "비데 : 2 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.20183,
        yRatio: 0.38830,
        size: 16,
        info: "화장실 // 조형관",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 상",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.27079,
        yRatio: 0.30640,
        size: 16,
        info: "화장실 // 미래관",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 하",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.53047,
        yRatio: 0.29467,
        size: 16,
        info: "화장실 // 배봉관",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 하",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.53844,
        yRatio: 0.47853,
        size: 16,
        info: "화장실 // 학생회관",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.64477,
        yRatio: 0.71302,
        size: 16,
        info: "화장실 // 정보기술관",
        password: "X",
        gender: "공용",
        description: "비데 : 2 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.62468,
        yRatio: 0.43781,
        size: 16,
        info: "화장실 // 인문학관 서쪽",
        password: "X",
        time: "월-금 / 06:00-23:00",
        gender: "공용",
        description: "비데 : 0 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.6454,
        yRatio: 0.52055,
        size: 16,
        info: "화장실 // 인문학관 동쪽",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.22514,
        yRatio: 0.53242,
        size: 16,
        info: "화장실 // 전농관 정문",
        password: "X",
        gender: "여성 전용",
        description: "정보 부족",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.24994,
        yRatio: 0.53242,
        size: 16,
        info: "화장실 // 전농관 쪽문",
        password: "X",
        gender: "남성 전용",
        description: "비데 : 1 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.35937,
        yRatio: 0.47139,
        size: 16,
        info: "화장실 // 건설공학관",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 하",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.41468,
        yRatio: 0.58149,
        size: 16,
        info: "화장실 // 21세기관 북쪽",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.44129,
        yRatio: 0.67712,
        size: 16,
        info: "화장실 // 21세기관 남쪽쪽",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 상",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.48582,
        yRatio: 0.78016,
        size: 16,
        info: "화장실 // 자연과학관",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.39951,
        yRatio: 0.27116,
        size: 16,
        info: "화장실 // 시대융합관",
        password: "X",
        gender: "공용",
        description: "비데 : 1 // 위생 : 중",
        flag: 1, // 말풍선 표시 (1이면 말풍선이 있는 마커)
        markerContent: "🚻" // 마커의 모양 (이모지 또는 텍스트)
    },
    {
        xRatio: 0.14491,
        yRatio: 0.39598,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "100주년기념관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.23763,
        yRatio: 0.54252,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "전농관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.22169,
        yRatio: 0.40707,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "조형관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.35575,
        yRatio: 0.45526,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "건설공학관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.24014,
        yRatio: 0.69429,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "경농관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.26618,
        yRatio: 0.64057,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "박물관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.25767,
        yRatio: 0.87294,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "법학관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.33335,
        yRatio: 0.70657,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "자작마루" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.42386,
        yRatio: 0.66606,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "21세기관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.46907,
        yRatio: 0.77209,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "자연과학관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.51933,
        yRatio: 0.66436,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "대강당" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.55292,
        yRatio: 0.76528,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "미디어관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.61705,
        yRatio: 0.70621,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "정보기술관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.64191,
        yRatio: 0.50027,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "인문학관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.55118,
        yRatio: 0.51504,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "학생회관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.60165,
        yRatio: 0.33071,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "창공관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.6085,
        yRatio: 0.25593,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "학군단" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.72367,
        yRatio: 0.27269,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "중앙도서관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.78673,
        yRatio: 0.58858,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "음악관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.81552,
        yRatio: 0.40678,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "국제학사" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.50952,
        yRatio: 0.31023,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "배봉관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.4594,
        yRatio: 0.30321,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "제2공학관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.40821,
        yRatio: 0.28415,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "시대융합관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.3357,
        yRatio: 0.29117,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "대학본부" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.32238,
        yRatio: 0.17384,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "과학기술관" // 마커의 모양 (텍스트)
    },
    {
        xRatio: 0.27074,
        yRatio: 0.31962,
        size: 8,
        flag: 0, // 말풍선 없음
        markerContent: "미래관" // 마커의 모양 (텍스트)
    }, 
];
